Documents/АктПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>АктПередачи</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначитьГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНазначатьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменялРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоВРаботуСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаРаботаСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоДругомуСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашенаЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбещаниеОплатить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКатегории</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УслугиПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УслугиПоДоговору</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/АктПередачи/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, ТаблицаДвиженийСобытия, Отказ) Экспорт
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);					  

	ПараметрыПринятияВРаботу = Новый Структура("ГраницаДоДокумента, Период, Сотрудник, Подразделение,
			| Организация, Автор, Ссылка",
			ЭтотОбъект.Ссылка.МоментВремени(), ЭтотОбъект.Дата, 
			ЭтотОбъект.СотрудникПринимающий, ЭтотОбъект.ПодразделениеПринимающее, 
			ЭтотОбъект.Организация, ЭтотОбъект.Автор, ЭтотОбъект.Ссылка);
	ПараметрыЗавершенияРаботы = Новый Структура("ГраницаДоДокумента, Период, Сотрудник, Подразделение,
			| Организация, Автор, Ссылка",
			ЭтотОбъект.Ссылка.МоментВремени(), ЭтотОбъект.Дата, 
			ЭтотОбъект.СотрудникПередающий, ЭтотОбъект.ПодразделениеПередающее, 
			ЭтотОбъект.Организация, ЭтотОбъект.Автор, ЭтотОбъект.Ссылка);	
	
	ТаблицаДОПринятияВРаботу        = Неопределено;
	ТаблицаСобытийПринятияВРаботу   = Неопределено;
	ТаблицаДОЗавершенияРаботы       = Неопределено;
	ТаблицаСобытийЗавершенияРаботы  = Неопределено;
	
	//проследить вариант с одинаковыми подразделениями
	
	Если Не ИнициализироватьДанныеПринятияВРаботу(ПараметрыПринятияВРаботу, ТаблицаДОПринятияВРаботу, 
			ТаблицаСобытийПринятияВРаботу) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Не ИнициализироватьДанныеЗавершенияРаботы(ПараметрыЗавершенияРаботы, ТаблицаДОЗавершенияРаботы, 
			ТаблицаСобытийЗавершенияРаботы) Тогда
		Отказ = Истина;	
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТаблицаДОПринятияВРаботу", ТаблицаДОПринятияВРаботу);
	Запрос.УстановитьПараметр("ТаблицаСобытийПринятияВРаботу", ТаблицаСобытийПринятияВРаботу);
	Запрос.УстановитьПараметр("ТаблицаДОЗавершенияРаботы", ТаблицаДОЗавершенияРаботы);
	Запрос.УстановитьПараметр("ТаблицаСобытийЗавершенияРаботы", ТаблицаСобытийЗавершенияРаботы);
	
	Если ТаблицаДОПринятияВРаботу <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ПОМЕСТИТЬ ТаблицаДОПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаДОПринятияВРаботу КАК Таблица";
		Если ПараметрыПринятияВРаботу.Подразделение = ПараметрыЗавершенияРаботы.Подразделение Тогда
			Запрос.Текст = Запрос.Текст + "
					   |ГДЕ 
					   |    Таблица.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)"
		КонецЕсли;				   
		Запрос.Текст = Запрос.Текст + "
					   |;
					   |
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
					   |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаСобытийПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийПринятияВРаботу.Период,
		               |	ТаблицаСобытийПринятияВРаботу.ВидДвижения,
		               |	ТаблицаСобытийПринятияВРаботу.Объект,
		               |	ТаблицаСобытийПринятияВРаботу.ВидСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.ИсточникСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.Сотрудник,
		               |	ТаблицаСобытийПринятияВРаботу.Автор,
		               |	ТаблицаСобытийПринятияВРаботу.НомерСтроки,
					   |    ТаблицаСобытийПринятияВРаботу.Подразделение
		               |ИЗ
		               |	ТаблицаСобытийПринятияВРаботу КАК ТаблицаСобытийПринятияВРаботу
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДОПринятияВРаботу КАК ТаблицаДОПринятияВРаботу
		               |		ПО ТаблицаСобытийПринятияВРаботу.Объект = ТаблицаДОПринятияВРаботу.Объект
		               |			И ТаблицаСобытийПринятияВРаботу.Сотрудник = ТаблицаДОПринятияВРаботу.Сотрудник
		               |			И ТаблицаСобытийПринятияВРаботу.Подразделение = ТаблицаДОПринятияВРаботу.Подразделение
					   |;
					   |
					   |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ИЗ
		               |	ТаблицаДОПринятияВРаботу КАК Таблица";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаСобытийПринятияВРаботу = Результат[2].Выгрузить();
		ТаблицаДОПринятияВРаботу = Результат[3].Выгрузить();
	КонецЕсли;	
	Если ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ПОМЕСТИТЬ ТаблицаДОЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаДОЗавершенияРаботы КАК Таблица";
		Если ПараметрыПринятияВРаботу.Подразделение = ПараметрыЗавершенияРаботы.Подразделение Тогда
			Запрос.Текст = Запрос.Текст + "
					   |ГДЕ 
					   |    Таблица.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)"
		КонецЕсли;				   
		Запрос.Текст = Запрос.Текст + "
					   |;   
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаСобытийЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийЗавершенияРаботы.Период,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидДвижения,
					   |	ТаблицаСобытийЗавершенияРаботы.Объект,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.ИсточникСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.Сотрудник,
		               |	ТаблицаСобытийЗавершенияРаботы.Автор,
		               |	ТаблицаСобытийЗавершенияРаботы.НомерСтроки,
					   |    ТаблицаСобытийЗавершенияРаботы.Подразделение
		               |ИЗ
		               |	ТаблицаСобытийЗавершенияРаботы КАК ТаблицаСобытийЗавершенияРаботы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДОЗавершенияРаботы КАК ТаблицаДОЗавершенияРаботы
		               |		ПО ТаблицаСобытийЗавершенияРаботы.Объект = ТаблицаДОЗавершенияРаботы.Объект
		               |			И ТаблицаСобытийЗавершенияРаботы.Сотрудник = ТаблицаДОЗавершенияРаботы.Сотрудник
		               |			И ТаблицаСобытийЗавершенияРаботы.Подразделение = ТаблицаДОЗавершенияРаботы.Подразделение
					   |;
					   |
					   |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
					   |ИЗ
		               |	ТаблицаДОЗавершенияРаботы КАК Таблица";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаСобытийЗавершенияРаботы = Результат[2].Выгрузить();
		ТаблицаДОЗавершенияРаботы = Результат[3].Выгрузить();
	КонецЕсли;
	
	Если ТаблицаДОПринятияВРаботу <> Неопределено И ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		Запрос.УстановитьПараметр("ТаблицаДОПринятияВРаботу", ТаблицаДОПринятияВРаботу);
		Запрос.УстановитьПараметр("ТаблицаСобытийПринятияВРаботу", ТаблицаСобытийПринятияВРаботу);
		Запрос.УстановитьПараметр("ТаблицаДОЗавершенияРаботы", ТаблицаДОЗавершенияРаботы);
		Запрос.УстановитьПараметр("ТаблицаСобытийЗавершенияРаботы", ТаблицаСобытийЗавершенияРаботы);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ПОМЕСТИТЬ ТаблицаДОЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаДОЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийЗавершенияРаботы
		               |ИЗ
		               |	&ТаблицаСобытийЗавершенияРаботы КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Сотрудник,
		               |	Таблица.Объект,
		               |	Таблица.Количество,
		               |	Таблица.НомерСтроки,
		               |	Таблица.Организация,
		               |	Таблица.Подразделение
		               |ПОМЕСТИТЬ ТаблицаДОПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаДОПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таблица.Период,
		               |	Таблица.ВидДвижения,
		               |	Таблица.Объект,
		               |	Таблица.ВидСобытия,
		               |	Таблица.ИсточникСобытия,
		               |	Таблица.Сотрудник,
		               |	Таблица.Подразделение,
		               |	Таблица.Автор,
		               |	Таблица.НомерСтроки
		               |ПОМЕСТИТЬ ТаблицаСобытийПринятияВРаботу
		               |ИЗ
		               |	&ТаблицаСобытийПринятияВРаботу КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДОЗавершенияРаботы.Период,
		               |	ТаблицаДОЗавершенияРаботы.ВидДвижения,
		               |	ТаблицаДОЗавершенияРаботы.Сотрудник,
		               |	ТаблицаДОЗавершенияРаботы.Объект,
		               |	ТаблицаДОЗавершенияРаботы.Количество,
		               |	ТаблицаДОЗавершенияРаботы.НомерСтроки,
		               |	ТаблицаДОЗавершенияРаботы.Организация,
		               |	ТаблицаДОЗавершенияРаботы.Подразделение
		               |ИЗ
		               |	ТаблицаДОЗавершенияРаботы КАК ТаблицаДОЗавершенияРаботы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаДОПринятияВРаботу.Период,
		               |	ТаблицаДОПринятияВРаботу.ВидДвижения,
		               |	ТаблицаДОПринятияВРаботу.Сотрудник,
		               |	ТаблицаДОПринятияВРаботу.Объект,
		               |	ТаблицаДОПринятияВРаботу.Количество,
		               |	ТаблицаДОПринятияВРаботу.НомерСтроки,
		               |	ТаблицаДОПринятияВРаботу.Организация,
		               |	ТаблицаДОПринятияВРаботу.Подразделение
		               |ИЗ
		               |	ТаблицаДОПринятияВРаботу КАК ТаблицаДОПринятияВРаботу
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийЗавершенияРаботы.Период,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидДвижения,
		               |	ТаблицаСобытийЗавершенияРаботы.Объект,
		               |	ТаблицаСобытийЗавершенияРаботы.ВидСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.ИсточникСобытия,
		               |	ТаблицаСобытийЗавершенияРаботы.Сотрудник,
		               |	ТаблицаСобытийЗавершенияРаботы.Автор,
		               |	ТаблицаСобытийЗавершенияРаботы.НомерСтроки
		               |ИЗ
		               |	ТаблицаСобытийЗавершенияРаботы КАК ТаблицаСобытийЗавершенияРаботы
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаблицаСобытийПринятияВРаботу.Период,
		               |	ТаблицаСобытийПринятияВРаботу.ВидДвижения,
		               |	ТаблицаСобытийПринятияВРаботу.Объект,
		               |	ТаблицаСобытийПринятияВРаботу.ВидСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.ИсточникСобытия,
		               |	ТаблицаСобытийПринятияВРаботу.Сотрудник,
		               |	ТаблицаСобытийПринятияВРаботу.Автор,
		               |	ТаблицаСобытийПринятияВРаботу.НомерСтроки
		               |ИЗ
		               |	ТаблицаСобытийПринятияВРаботу КАК ТаблицаСобытийПринятияВРаботу";
		Результат = Запрос.ВыполнитьПакет();
		ТаблицаДвиженийОбъекты = Результат[4].Выгрузить();
		ТаблицаДвиженийСобытия = Результат[5].Выгрузить();
	ИначеЕсли ТаблицаДОЗавершенияРаботы <> Неопределено Тогда
		ТаблицаДвиженийОбъекты = ТаблицаДОЗавершенияРаботы;
		ТаблицаДвиженийСобытия = ТаблицаСобытийЗавершенияРаботы;
	Иначе
		ТаблицаДвиженийОбъекты = ТаблицаДОПринятияВРаботу;
		ТаблицаДвиженийСобытия = ТаблицаСобытийПринятияВРаботу;
	КонецЕсли;
КонецПроцедуры

Функция ИнициализироватьДанныеЗавершенияРаботы(Параметры, ТаблицаДолговыхОбязательств, ТаблицаСобытий)
	Если Параметры.Подразделение.Пустая() И Параметры.Сотрудник.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",	Параметры.ГраницаДоДокумента);
	Запрос.УстановитьПараметр("Период",	Параметры.Период);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Автор", Параметры.Автор);
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
		
	Если Параметры.Подразделение.Пустая() Тогда
		Запрос.Текст = "";
	ИначеЕсли Параметры.Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки,
		               |	ОбъектыВРаботеОстатки.Сотрудник
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&ГраницаДоДокумента, Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ОбъектыВРаботеОстатки.Сотрудник,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	&Подразделение КАК Подразделение,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	Таблица.НомерСтроки,
		               |	ВЫБОР
		               |		КОГДА Таблица.ОстатокВРаботе > 0
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ОтказПоПодразделению,
		               |	&Организация,
		               |	Таблица.Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОтказПоПодразделению,
		               |	Таблица.НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ВЫБОР
		               |		КОГДА Таблица.Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаПодразделения)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника)
		               |	КОНЕЦ КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	&Подразделение КАК Подразделение,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки,
		               |	Таблица.Сотрудник КАК Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сотрудник УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
	Иначе //Подразеделине и Отвественный не пустые
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Подразделение = &Подразделение
		               |					И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	&Сотрудник КАК Сотрудник,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	Таблица.НомерСтроки,
		               |	ВЫБОР
		               |		КОГДА Таблица.ОстатокВРаботе > 0
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ОтказПоСотруднику,
		               |	&Организация,
		               |	&Подразделение
		               |ИЗ
		               |	Таблица КАК Таблица
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОтказПоСотруднику УБЫВ,
		               |	Таблица.НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗавершенаРаботаСотрудника) КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	&Сотрудник КАК Сотрудник,
		               |	&Подразделение,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки
		               |ИЗ
		               |	Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДолговыхОбязательств = Результат[1].Выгрузить();
	ТаблицаСобытий = Результат[2].Выгрузить();
	 
	Если ТаблицаДолговыхОбязательств.Количество() > 0 Тогда
		Попытка 
			Если ТаблицаДолговыхОбязательств[0].ОтказПоСотруднику = Истина Тогда
				ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе у сотрудника %Сотрудник%.""");
				ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", ТаблицаДолговыхОбязательств[0].Объект);	
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Сотрудник%", ТаблицаДолговыхОбязательств[0].Сотрудник);	
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
				Возврат Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Попытка
			Если ТаблицаДолговыхОбязательств[0].ОтказПоПодразделению = Истина Тогда
				ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе у подразделения %Подразделение%.""");
	            ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", ТаблицаДолговыхОбязательств[0].Объект);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Подразделение%", ТаблицаДолговыхОбязательств[0].Подразделение);		
				УдалитьОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
		    	Возврат Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
	Возврат Истина;
КонецФункции

Функция ИнициализироватьДанныеПринятияВРаботу(Параметры, ТаблицаДолговыхОбязательств, ТаблицаСобытий)
	Если Параметры.Подразделение.Пустая() И Параметры.Сотрудник.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",	Параметры.ГраницаДоДокумента);
	Запрос.УстановитьПараметр("Период",	Параметры.Период);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Автор", Параметры.Автор);
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
		
	Если Параметры.Подразделение.Пустая() Тогда
        Запрос.Текст = ""; 
		//Проверка на В РАБОТЕ организации
		//Исключить те, у которых уже есть в работе Сотр
	ИначеЕсли Параметры.Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ КАК Объект,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		               |ПОМЕСТИТЬ Таблица
		               |ИЗ
		               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		               |ГДЕ
		               |	АктПередачиОбъекты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		               |		ИНАЧЕ АктПередачиОбъекты.Объект
		               |	КОНЕЦ,
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		               |	&Подразделение КАК Подразделение,
		               |	Таблица.Объект,
		               |	1 КАК Количество,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОтказПоПодразделению,
		               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		               |	Таблица.НомерСтроки КАК НомерСтроки,
		               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		               |	&Сотрудник
		               |ИЗ
		               |	Таблица КАК Таблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = &Подразделение
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		               |ГДЕ
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		               |	Таблица.Объект,
		               |	1,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ,
		               |	Таблица.ОстатокВРаботе,
		               |	Таблица.НомерСтроки,
		               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		               |ИЗ
		               |	Таблица КАК Таблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |				&ГраницаДоДокумента,
		               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		               |ГДЕ
		               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ОстатокВРаботе,
		               |	ОтказПоПодразделению,
		               |	НомерСтроки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	&Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		               |	Таблица.Объект,
		               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		               |	&Ссылка КАК ИсточникСобытия,
		               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		               |	&Подразделение КАК Подразделение,
		               |	&Сотрудник КАК Сотрудник1,
		               |	&Автор,
		               |	Таблица.НомерСтроки КАК НомерСтроки
		               |ИЗ
		               |	Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ Таблица";
		//Проверка на В РАБОТЕ организации
        //Исключить те, которые есть в работе Подр
	Иначе //Подразделение и Сотрудник не пустые
		 //////////////////Запрос.Текст = "ВЫБРАТЬ
		 //////////////////               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		 //////////////////               |		КОГДА ТИП(Справочник.ИсполнительныеДокументы)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец
		 //////////////////               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		 //////////////////               |		ИНАЧЕ АктПередачиОбъекты.Объект
		 //////////////////               |	КОНЕЦ КАК Объект,
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		 //////////////////               |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		 //////////////////               |ПОМЕСТИТЬ Таблица
		 //////////////////               |ИЗ
		 //////////////////               |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		 //////////////////               |ГДЕ
		 //////////////////               |	АктПередачиОбъекты.Ссылка = &Ссылка
		 //////////////////               |
		 //////////////////               |СГРУППИРОВАТЬ ПО
		 //////////////////               |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		 //////////////////               |		КОГДА ТИП(Справочник.ИсполнительныеДокументы)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.ИсполнительныеДокументы).Владелец
		 //////////////////               |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		 //////////////////               |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		 //////////////////               |		ИНАЧЕ АктПередачиОбъекты.Объект
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 //////////////////               |	&Подразделение КАК Подразделение,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1 КАК Количество,
		 //////////////////               |	ЛОЖЬ КАК ОтказПоСотруднику,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ КАК ОтказПоПодразделению,
		 //////////////////               |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки КАК НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = &Подразделение
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	&Подразделение,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА Таблица.ОстатокВРаботе > 0
		 //////////////////               |			ТОГДА ЛОЖЬ
		 //////////////////               |		ИНАЧЕ ИСТИНА
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	Таблица.ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		 //////////////////               |	&Сотрудник
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = &Подразделение
		 //////////////////               |					И Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	1,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		 //////////////////               |			ТОГДА ИСТИНА
		 //////////////////               |		ИНАЧЕ ЛОЖЬ
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	ВЫБОР
		 //////////////////               |		КОГДА Таблица.ОстатокВРаботе > 0
		 //////////////////               |			ТОГДА ЛОЖЬ
		 //////////////////               |		ИНАЧЕ ИСТИНА
		 //////////////////               |	КОНЕЦ,
		 //////////////////               |	Таблица.ОстатокВРаботе,
		 //////////////////               |	Таблица.НомерСтроки,
		 //////////////////               |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		 //////////////////               |				&ГраницаДоДокумента,
		 //////////////////               |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		 //////////////////               |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		 //////////////////               |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
		 //////////////////               |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		 //////////////////               |ГДЕ
		 //////////////////               |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		 //////////////////               |
		 //////////////////               |УПОРЯДОЧИТЬ ПО
		 //////////////////               |	ОстатокВРаботе,
		 //////////////////               |	ОтказПоПодразделению,
		 //////////////////               |	ОтказПоСотруднику,
		 //////////////////               |	НомерСтроки
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		 //////////////////               |	&Ссылка КАК ИсточникСобытия,
		 //////////////////               |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		 //////////////////               |	&Подразделение КАК Подразделение,
		 //////////////////               |	&Автор,
		 //////////////////               |	Таблица.НомерСтроки КАК НомерСтроки
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |
		 //////////////////               |ОБЪЕДИНИТЬ ВСЕ
		 //////////////////               |
		 //////////////////               |ВЫБРАТЬ
		 //////////////////               |	&Период,
		 //////////////////               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		 //////////////////               |	Таблица.Объект,
		 //////////////////               |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуСотрудником),
		 //////////////////               |	&Ссылка,
		 //////////////////               |	&Сотрудник,
		 //////////////////               |	&Подразделение,
		 //////////////////               |	&Автор,
		 //////////////////               |	Таблица.НомерСтроки
		 //////////////////               |ИЗ
		 //////////////////               |	Таблица КАК Таблица
		 //////////////////               |;
		 //////////////////               |
		 //////////////////               |////////////////////////////////////////////////////////////////////////////////
		 //////////////////               |УНИЧТОЖИТЬ Таблица";
						
						
						
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		                |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		                |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		                |		ИНАЧЕ АктПередачиОбъекты.Объект
		                |	КОНЕЦ КАК Объект,
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) КАК ОстатокВРаботе,
		                |	МИНИМУМ(АктПередачиОбъекты.НомерСтроки) КАК НомерСтроки
		                |ПОМЕСТИТЬ Таблица
		                |ИЗ
		                |	Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО (АктПередачиОбъекты.Объект = ОбъектыВРаботеОстатки.Объект
		                |				ИЛИ ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец = ОбъектыВРаботеОстатки.Объект)
		                |ГДЕ
		                |	АктПередачиОбъекты.Ссылка = &Ссылка
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	ВЫБОР ТИПЗНАЧЕНИЯ(АктПередачиОбъекты.Объект)
		                |		КОГДА ТИП(Справочник.УслугиПоДоговору)
		                |			ТОГДА ВЫРАЗИТЬ(АктПередачиОбъекты.Объект КАК Справочник.УслугиПоДоговору).Владелец
		                |		ИНАЧЕ АктПередачиОбъекты.Объект
		                |	КОНЕЦ,
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0)
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                |	&Подразделение КАК Подразделение,
		                |	Таблица.Объект,
		                |	1 КАК Количество,
		                |	ЛОЖЬ КАК ОтказПоСотруднику,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ КАК ОтказПоПодразделению,
		                |	Таблица.ОстатокВРаботе КАК ОстатокВРаботе,
		                |	Таблица.НомерСтроки КАК НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = &Подразделение
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	&Подразделение,
		                |	Таблица.Объект,
		                |	1,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ,
		                |	ВЫБОР
		                |		КОГДА Таблица.ОстатокВРаботе > 0
		                |			ТОГДА ЛОЖЬ
		                |		ИНАЧЕ ИСТИНА
		                |	КОНЕЦ,
		                |	Таблица.ОстатокВРаботе,
		                |	Таблица.НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		                |	&Сотрудник
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = &Подразделение
		                |					И Сотрудник = &Сотрудник
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		                |	Таблица.Объект,
		                |	1,
		                |	ВЫБОР
		                |		КОГДА ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) > 0
		                |			ТОГДА ИСТИНА
		                |		ИНАЧЕ ЛОЖЬ
		                |	КОНЕЦ,
		                |	ВЫБОР
		                |		КОГДА Таблица.ОстатокВРаботе > 0
		                |			ТОГДА ЛОЖЬ
		                |		ИНАЧЕ ИСТИНА
		                |	КОНЕЦ,
		                |	Таблица.ОстатокВРаботе,
		                |	Таблица.НомерСтроки,
		                |	ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |ИЗ
		                |	Таблица КАК Таблица
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(
		                |				&ГраницаДоДокумента,
		                |				Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец
		                |					И Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		                |					И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		                |					И Объект В
		                |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |							АктПередачиОбъекты.Ссылка
		                |						ИЗ
		                |							Документ.АктПередачи.Объекты КАК АктПередачиОбъекты
		                |						ГДЕ
		                |							АктПередачиОбъекты.Ссылка = &Ссылка)) КАК ОбъектыВРаботеОстатки
		                |		ПО Таблица.Объект = ОбъектыВРаботеОстатки.Объект
		                |ГДЕ
		                |	ЕСТЬNULL(ОбъектыВРаботеОстатки.КоличествоОстаток, 0) = 0
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	ОстатокВРаботе,
		                |	ОтказПоПодразделению,
		                |	ОтказПоСотруднику,
		                |	НомерСтроки
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                |	Таблица.Объект,
		                |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуПодразделения) КАК ВидСобытия,
		                |	&Ссылка КАК ИсточникСобытия,
		                |	ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) КАК Сотрудник,
		                |	&Подразделение КАК Подразделение,
		                |	&Автор,
		                |	Таблица.НомерСтроки КАК НомерСтроки
		                |ИЗ
		                |	Таблица КАК Таблица
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	&Период,
		                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                |	Таблица.Объект,
		                |	ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ПринятоВРаботуСотрудником),
		                |	&Ссылка,
		                |	&Сотрудник,
		                |	&Подразделение,
		                |	&Автор,
		                |	Таблица.НомерСтроки
		                |ИЗ
		                |	Таблица КАК Таблица
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |УНИЧТОЖИТЬ Таблица";
						
		//Проверка на В РАБОТЕ организации
        //Исключить те, которые есть в работе Подр и Сотр
	КонецЕсли;
		
	Результат = Запрос.ВыполнитьПакет();                             
	ТаблицаДолговыхОбязательств = Результат[1].Выгрузить();
	ТаблицаСобытий = Результат[2].Выгрузить();
	
	//Если ТаблицаДолговыхОбязательств.Количество() > 0 И ТаблицаДолговыхОбязательств[0].ОстатокВРаботе <> 1 Тогда
	//	ШаблонСообщения = НСтр("ru = ""Объект: %Объект% не числится в работе!""");	
	//	ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Объект%", 
	//			ТаблицаДолговыхОбязательств[0].Объект);
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Параметры.Ссылка,,,);
	//	Возврат Ложь;
	//КонецЕсли;
	Возврат Истина;
КонецФункции
